Data-Analyst-Job-Market-In-Deutschland

In [25]:
import pandas as pd
import numpy as np

# 1. USA-Daten (dein Kaggle Dataset)
df_usa = pd.read_csv('data/DataAnalyst.csv',delimiter=',')

df_usa.head(1)

,Unnamed: 0,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,Industry,Sector,Revenue,Competitors,Easy Apply
0,0,"Data Analyst, Center on Immigration and Justic...",$37K-$66K (Glassdoor est.),Are you eager to roll up your sleeves and harn...,3.2,Vera Institute of Justice\n3.2,"New York, NY","New York, NY",201 to 500 employees,1961,Nonprofit Organization,Social Assistance,Non-Profit,$100 to $500 million (USD),-1,True

In [27]:
# 2. Deutschland - Manuelle Daten (ergänzend)
germany_data = {
    'Country': ['Germany'] * 4,
    'City': ['Düsseldorf'] * 4,
    'Job_Title': ['Data Analyst', 'Data Analyst', '3D Artist', '3D Artist'],
    'Level': ['Entry', 'Senior', 'Entry', 'Senior'],
    'Avg_Salary_EUR': [50100, 80000, 36400, 50000],
    'Job_Count_Duesseldorf': [497, np.nan, 4, np.nan],
    'Source': ['StepStone 2026'] * 4
}

df_germany = pd.DataFrame(germany_data)

# 3. Währungsumrechnung für Vergleich
exchange_rate = 0.92  # USD to EUR (aktuell anpassen)

df_germany

,Country,City,Job_Title,Level,Avg_Salary_EUR,Job_Count_Duesseldorf,Source
0,Germany,Düsseldorf,Data Analyst,Entry,50100,497.0,StepStone 2026
1,Germany,Düsseldorf,Data Analyst,Senior,80000,NaN,StepStone 2026
2,Germany,Düsseldorf,3D Artist,Entry,36400,4.0,StepStone 2026
3,Germany,Düsseldorf,3D Artist,Senior,50000,NaN,StepStone 2026